In [1]:
import pandas as pd

In [8]:
session1 = pd.read_excel('data/Attendence of Members - Sessions 1 - 20.xls', skiprows=4)
session2 = pd.read_excel('data/Attendence of Members - Sessions 21 - 43.xls', skiprows=4)

In [9]:
session1.head()

  Sl. No. Constituency                Name of Member Status
0       1         NA-1  Moulana Abdul Akbar Chitrali      P
1       2         NA-2           Dr. Haider Ali Khan      P
2       3         NA-3            Mr. Saleem  Rehman      P
3       4         NA-4               Mr. Murad Saeed      P
4       5         NA-5        Sahibzada Sibghatullah      P

In [10]:
session2.head()

  Sl. No. Constituency                Name of Member Status
0       1         NA-1  Moulana Abdul Akbar Chitrali      P
1       2         NA-2           Dr. Haider Ali Khan      P
2       3         NA-3            Mr. Saleem  Rehman      P
3       4         NA-4               Mr. Murad Saeed      P
4       5         NA-5        Sahibzada Sibghatullah      P

In [11]:
session1.shape

(37243, 4)

In [15]:
session1.groupby('Constituency').count()

                Sl. No.  Name of Member  Status
Constituency
Consituancy           1               1       0
Constituency        148             148     148
NA-1                145             145     144
NA-10                86              86      85
NA-100              105             105     104
...                 ...             ...     ...
Reserve seat         58              58      58
Reserved Seat      7713            7713    7713
Reserved Seate       64              64      64
Reserved Seats      198             198     130
Reserved seat        58              58      58

[347 rows x 3 columns]

In [17]:
session1.loc[session1.Constituency == 'Consituancy'].index

Int64Index([300], dtype='int64')

In [18]:
session1['Constituency'].iloc[300] = 'Constituency'

In [20]:
session1.iloc[300]

Sl. No.                  S.l #
Constituency      Constituency
Name of Member            Name
Status                     NaN
Name: 300, dtype: object

In [21]:
session1.groupby('Constituency').count()

                Sl. No.  Name of Member  Status
Constituency
Constituency        149             149     148
NA-1                145             145     144
NA-10                86              86      85
NA-100              105             105     104
NA-101               22              22      21
...                 ...             ...     ...
Reserve seat         58              58      58
Reserved Seat      7713            7713    7713
Reserved Seate       64              64      64
Reserved Seats      198             198     130
Reserved seat        58              58      58

[346 rows x 3 columns]

In [24]:
na_records = pd.read_excel('data/NA-Records.xlsx', skiprows=3)

In [27]:
na_records

,Division,District,Provincial Assembly Constituency,National Assembly Constituency
0,Khyber Pakhtunkhwa,NaN,NaN,NaN
1,Malakand,Upper Chitral,PK-1 Upper Chitral,NA-1 Chitral
2,NaN,Lower Chitral,PK-2 Lower Chitral,NaN
3,NaN,Swat,PK-3 Swat-I,NA-2 Swat-I
4,NaN,NaN,PK-4 Swat-II,NaN
...,...,...,...,...
601,NaN,NaN,PB-47 Pishin-II,NaN
602,NaN,NaN,PB-48 Pishin-III,NaN
603,NaN,Killa Abdullah,PB-49 Killa Abdullah,NA-266 (Killa Abdullah-cum-Chaman)
604,NaN,Chaman,PB-50 Chaman-I,NaN
605,NaN,NaN,PB-51 Chaman-II,NaN

In [29]:
na_records.columns

Index(['Division', 'District', 'Provincial Assembly Constituency',
       'National Assembly Constituency'],
      dtype='object')

In [30]:
na_records.columns = ['division', 'district', 'pac', 'nac']

In [31]:
na_records.head()

             division       district                 pac           nac
0  Khyber Pakhtunkhwa            NaN                 NaN           NaN
1            Malakand  Upper Chitral  PK-1 Upper Chitral  NA-1 Chitral
2                 NaN  Lower Chitral  PK-2 Lower Chitral           NaN
3                 NaN           Swat         PK-3 Swat-I   NA-2 Swat-I
4                 NaN            NaN        PK-4 Swat-II           NaN

In [45]:
na_records.dropna(subset=['nac'], inplace=True)

In [48]:
na_records.reset_index(inplace=True)
na_records.head()

   index  division       district                  pac             nac
0      1  Malakand  Upper Chitral   PK-1 Upper Chitral    NA-1 Chitral
1      3       NaN           Swat          PK-3 Swat-I     NA-2 Swat-I
2      5       NaN            NaN        PK-5 Swat-III    NA-3 Swat-II
3      7       NaN            NaN          PK-7 Swat-V   NA-4 Swat-III
4     10       NaN      Upper Dir  PK-10 (Upper Dir-I)  NA-5 Upper Dir

In [54]:
# na_records['const'] = na_records['nac'].str.extract(r'(NA-\d+) ')[0]

In [58]:
easy_cols = na_records.columns

In [59]:
df_columns = ['index', 'Division', 'District', 'Provincial Assembly Constituency', 'National Assembly Constituency', 'Constituency']
na_records.columns = df_columns

In [61]:
na_records.to_csv('data/modified/National Assembly.csv', index=False)

In [62]:
na_records.head()

,index,Division,District,Provincial Assembly Constituency,National Assembly Constituency,Constituency
0,1,Malakand,Upper Chitral,PK-1 Upper Chitral,NA-1 Chitral,NA-1
1,3,NaN,Swat,PK-3 Swat-I,NA-2 Swat-I,NA-2
2,5,NaN,NaN,PK-5 Swat-III,NA-3 Swat-II,NA-3
3,7,NaN,NaN,PK-7 Swat-V,NA-4 Swat-III,NA-4
4,10,NaN,Upper Dir,PK-10 (Upper Dir-I),NA-5 Upper Dir,NA-5